#==============
# Taps
#==============
tap "buo/cask-upgrade"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "yt-dlp/taps"

#==============
# Set arguments for all installation commands
#==============
cask_args appdir: "/Applications", require_sha: true

#==============
# Formulae
#==============
brew "ansible"
brew "cmake"
brew "curl"
brew "exa"
brew "exiftool"
brew "fish"
brew "fzf"
brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "goto"
brew "htop"
brew "imagemagick"
brew "java"
brew "lazydocker"
brew "llvm"
brew "md5deep"
brew "media-info"
brew "neovim"
brew "node"
brew "npm"
brew "nvm"
brew "python"
brew "neofetch"
brew "pinentry-mac"
brew "rclone"
brew "rsync"
brew "rust"
brew "smartmontools"
brew "starship"
brew "stow"
brew "tmux"
brew "tree"
brew "wget"
brew "yarn"
brew "yt-dlp"

#==============
# Casks
#==============
cask "arc"
cask "balenaetcher"
cask "brave-browser"
cask "discord"
cask "docker"
cask "fleet"
cask "font-fira-code-nerd-font"
cask "github"
cask "gitkraken"
cask "intellij-idea"
cask "iterm2"
cask "keepassxc"
cask "ledger-live"
cask "linear-linear"
cask "little-snitch"
cask "macfuse"
cask "netnewswire"
cask "obsidian"
cask "onlyoffice"
cask "pycharm"
cask "raycast"
cask "signal"
cask "slack"
cask "standard-notes"
cask "termius"
cask "tor-browser"
cask "veracrypt"
cask "visual-studio-code"
cask "warp"
cask "zed"
cask "zoom"

#==============
# Casks by Objective-See
#==============
# cask "blockblock"
# cask "dhs"
# cask "do-not-disturb"
# cask "knockknock"
# cask "lulu"
# cask "netiquette"
# cask "oversight"
# cask "ransomwhere"
# cask "reikey"

#==============
# App Store
#==============
# Bitwarden
# Infuse
# MS Office
# Raivo-OTP
# Tailscale
# Yubico Autheticator
