#==============
# Taps
#==============
tap "buo/cask-upgrade"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "yt-dlp/taps"

#==============
# Set arguments for all installation commands
#==============
cask_args appdir: "/Applications", require_sha: true

#==============
# Formulae
#==============
brew "ansible"
brew "asitop"
brew "basictex
brew "cmake"
brew "curl"
brew "eza"
brew "exiftool"
brew "fish"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gh"
brew "git"
brew "git-lfs"
brew "git-quick-stats"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "goto"
brew "htop"
brew "imagemagick"
brew "java"
brew "julia"
brew "jq"
brew "lazydocker"
brew "llvm"
brew "mactop"
brew "mas"
brew "md5deep"
brew "media-info"
brew "mockery"
brew "neovim"
brew "node"
brew "npm"
brew "nvm"
brew "ocaml"
brew "opam"
brew "pipx"
brew "python"
brew "neofetch"
brew "pinentry-mac"
brew "pre-commit"
brew "protobuf"
brew "r"
brew "rclone"
brew "rg"
brew "rsync"
brew "rust"
brew "smartmontools"
brew "starship"
brew "stow"
brew "swift-protobuf"
brew "tmux"
brew "tree"
brew "wget"
brew "yarn"
brew "yt-dlp"

#==============
# Casks
#==============
cask "arc"
cask "balenaetcher"
cask "brave-browser"
cask "discord"
cask "docker"
cask "font-fira-code-nerd-font"
cask "github"
cask "gitkraken"
cask "goland"
cask "intellij-idea"
cask "iterm2"
cask "keepassxc"
cask "ledger-live"
cask "linear-linear"
cask "little-snitch"
cask "macfuse"
cask "netnewswire"
cask "nmap"
cask "obsidian"
cask "onlyoffice"
cask "pycharm"
cask "raycast"
cask "signal"
cask "slack"
cask "standard-notes"
cask "termius"
cask "tor-browser"
cask "veracrypt"
cask "visual-studio-code"
cask "warp"
cask "zed"
cask "zoom"

#==============
# App Store
#==============
mas 'Bitwarden', id: 1352778147
mas 'Infuse', id: 1136220934
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft PowerPoint', id: 462062816
mas 'Microsoft Word', id: 462054704
mas 'OneDrive', id: 823766827
mas 'Raivo OTP', id: 1498497896
mas 'TestFlight', id: 899247664
mas 'Tailscale', id: 1475387142
mas 'Xcode', id: 497799835
mas 'Yubico Authenticator', id: 1497506650
